In [3]:
import pandas as pd
samuel = pd.read_csv('C:/Users/nswat/Documents/DataCamp/Datasets/4JoiningDataWPandasDatasets/samuel.csv', 
                     index_col=['movie_id', 
                                'cast_id'])

samuel.head()

                               name
movie_id cast_id
184      3        Samuel L. Jackson
319      13       Samuel L. Jackson
326      2        Samuel L. Jackson
329      138      Samuel L. Jackson
393      21       Samuel L. Jackson

In [4]:
casts = pd.read_csv('C:/Users/nswat/Documents/DataCamp/Datasets/4JoiningDataWPandasDatasets/casts2.csv', 
                       index_col=['movie_id',
                                  'cast_id'])

casts.head()

                 character
movie_id cast_id
5        22        Jezebel
         23          Diana
         24         Athena
         25        Elspeth
         26            Eva